___

<a href='http://www.pieriandata.com'> <img src='../../Pierian_Data_Logo.png' /></a>
___

# SF Salaries Exercise 

Welcome to a quick exercise for you to practice your pandas skills! We will be using the [SF Salaries Dataset](https://www.kaggle.com/kaggle/sf-salaries) from Kaggle! Just follow along and complete the tasks outlined in bold below. The tasks will get harder and harder as you go along.

** Import pandas as pd.**

In [15]:
import pandas as pd

** Read Salaries.csv as a dataframe called sal.**

In [32]:
df = pd.read_csv("../DataSets/Salaries.csv", nrows=1300)

** Check the head of the DataFrame. **

In [33]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

** Use the .info() method to find out how many entries there are.**

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1300 entries, 0 to 1299
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Id                1300 non-null   int64
 1   EmployeeName      1300 non-null   object
 2   JobTitle          1300 non-null   object
 3   BasePay           1300 non-null   float64
 4   OvertimePay       1300 non-null   float64
 5   OtherPay          1300 non-null   float64
 6   Benefits          0 non-null      float64
 7   TotalPay          1300 non-null   float64
 8   TotalPayBenefits  1300 non-null   float64
 9   Year              1300 non-null   int64
 10  Notes             0 non-null      float64
 11  Agency            1300 non-null   object
 12  Status            0 non-null      float64
dtypes: float64(8), int64(2), object(3)
memory usage: 132.2+ KB

**What is the average BasePay ?**

In [35]:
df['BasePay'].mean()

145236.69506923077

** What is the highest amount of OvertimePay in the dataset ? **

In [36]:
df['OvertimePay'].max()

245131.88

** What is the job title of  JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll). **

In [37]:
df[df['EmployeeName'] == "JOSEPH DRISCOLL"]['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

** How much does JOSEPH DRISCOLL make (including benefits)? **

In [38]:
df[df['EmployeeName'] == "JOSEPH DRISCOLL"]['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

** What is the name of highest paid person (including benefits)?**

In [39]:
df[df["TotalPayBenefits"] == df["TotalPayBenefits"].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

** What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**

In [40]:
df[df["TotalPay"] == df["TotalPay"].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
1293,1294,KIMBERLY WILLIAMS,ATTORNEY (CIVIL/CRIMINAL),164352.63,0.0,0.0,NaN,164352.63,164352.63,2011,NaN,San Francisco,NaN
1294,1295,CATHARINE BARNES,ATTORNEY (CIVIL/CRIMINAL),164352.63,0.0,0.0,NaN,164352.63,164352.63,2011,NaN,San Francisco,NaN
1295,1296,MARGARET BAUMGARTNER,ATTORNEY (CIVIL/CRIMINAL),164352.63,0.0,0.0,NaN,164352.63,164352.63,2011,NaN,San Francisco,NaN
1296,1297,JENNIFER CHOI,ATTORNEY (CIVIL/CRIMINAL),164352.63,0.0,0.0,NaN,164352.63,164352.63,2011,NaN,San Francisco,NaN
1297,1298,SHERRI KAISER,ATTORNEY (CIVIL/CRIMINAL),164352.63,0.0,0.0,NaN,164352.63,164352.63,2011,NaN,San Francisco,NaN
1298,1299,MARK LIPTON,ATTORNEY (CIVIL/CRIMINAL),164352.63,0.0,0.0,NaN,164352.63,164352.63,2011,NaN,San Francisco,NaN
1299,1300,STACEY LUCAS,ATTORNEY (CIVIL/CRIMINAL),164352.63,0.0,0.0,NaN,164352.63,164352.63,2011,NaN,San Francisco,NaN

** What was the average (mean) BasePay of all employees per year? (2011-2014) ? **

In [42]:
df.groupby("Year")["BasePay"].mean()

Year
2011    145236.695069
Name: BasePay, dtype: float64

** How many unique job titles are there? **

In [45]:
df["JobTitle"].nunique()

124

** What are the top 5 most common jobs? **

In [49]:
df["JobTitle"].value_counts().head()

JobTitle
FIREFIGHTER                         169
ATTORNEY (CIVIL/CRIMINAL)           108
LIEUTENANT, FIRE DEPARTMENT          71
SERGEANT III (POLICE DEPARTMENT)     57
POLICE OFFICER III                   53
Name: count, dtype: int64

** How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?) **

202

** How many people have the word Chief in their job title? (This is pretty tricky) **

477

** Bonus: Is there a correlation between length of the Job Title string and Salary? **

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

# Great Job!